OdRxTypePromotionAttribute.properties
\details
Gets the list of subproperties.
\returns
List of subproperties.

OdRxTypePromotionAttribute.createObject(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor. Creates an attribute that defines which subproperties to show
besides the property in the promotion mode with OdRxPromotingQueryContext.
\param properties [in]  List of subproperties.
\returns
Smart pointer to a constructed attribute object.